Revit 2026 API

# SlabShapeEditorAddPoints Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<SlabShapeVertex> AddPoints(
	IList<XYZ> points
)
```
```vb
Public Function AddPoints (
	points As IList(Of XYZ)
) As IList(Of SlabShapeVertex)
```
```cpp
public:
IList<SlabShapeVertex^>^ AddPoints(
	IList<XYZ^>^ points
)
```
```fsharp
member AddPoints :
        points : IList<XYZ> -> IList<SlabShapeVertex>
```

#### Parameters

points IListXYZ

#### Return Value

IListSlabShapeVertex

#### Reference

SlabShapeEditor Class

Autodesk.Revit.DB Namespace